---
kind: type
id: T:Autodesk.Revit.UI.RevisionsOnSheetUIServiceData
source: html/9227d1b5-f1cf-1da3-3f1d-ba982bf87141.htm
---
# Autodesk.Revit.UI.RevisionsOnSheetUIServiceData

UI data wrapper for RevisionsOnSheetUIService.

## Syntax (C#)
```csharp
public class RevisionsOnSheetUIServiceData : IDisposable
```